brew "bat"
brew "docker-completion"
brew "docker"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "lazygit"
brew "nano"
brew "nvm"
brew "ripgrep"
brew "starship"
brew "stow"
brew "zoxide"
brew "neovim"
brew "pspg"
cask "font-fira-code-nerd-font"
cask "maccy"
cask "macshot"
cask "orbstack"
cask "rectangle"
cask "rio"
vscode "akamud.vscode-theme-onedark"
vscode "christian-kohler.npm-intellisense"
vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "imfeniljikadara.figure"
vscode "jdinhlife.gruvbox"
vscode "louiswt.regexp-preview"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mikeburgh.xml-format"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "saposs.xml-toolkit"
vscode "sreetamd.karma"
vscode "technosophos.vscode-helm"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "tomoki1207.pdf"
vscode "typespec.typespec-vscode"
vscode "vscode-icons-team.vscode-icons"
vscode "whizkydee.material-palenight-theme"
vscode "zhuangtongfa.material-theme"
